//TODO: № 1 на if...else ===============================================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'.
// const a = 11;
// if (a === 10) {
//   console.log("Вірно");
// } else {
//   console.log("Невірно");
// }

// Другий варіант

// console.log(a === 10 ? "Вірно" : "Невірно");

// /TODO: № 3 на if...else if ===============================================
// // У змінній min лежить число від 0 до 59. Визначте у котру чверть години
// // Попадає це число (у першу, другу, третю або четверту).

// const min = 69;
// if (0 < min && min <= 15) {
//   console.log("перша");
// } else if (15 < min && min<= 30) {
//   console.log("двуга");
// } else if (30 < min &&  min<= 45) {
//   console.log("третя");
// } else if (45 < min && min<= 59) {
//   console.log("четверта");
// } else {
//   console.log("щоооо?");
// }
